app/controllers/equipes_controller.rb

  def index
    @equipes = Equipe.all
---
SELECT "equipes".* FROM "equipes"

  def create
    @equipe = Equipe.new(equipe_params)

    if @equipe.save
---
INSERT INTO "equipes" ("nome", "total_jogadores", "total_defesa", "total_ataque", "total_meio", "imagem", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @equipe.update(equipe_params)
---
UPDATE "equipes" SET "nome" = ?, "total_jogadores" = ?, "total_defesa" = ?, "total_ataque" = ?, "total_meio" = ?, "updated_at" = ? WHERE "equipes"."id" = ?  [["nome", "teste2222"], ["total_jogadores", 20], ["total_defesa", 6], ["total_ataque", 8], ["total_meio", 6], ["updated_at", "2023-01-26 04:06:31.392433"], ["id", 2]]

  def destroy
    @equipe.destroy
---
DELETE FROM "equipes" WHERE "equipes"."id" = ?  [["id", 3]]

  def random
    count = Equipe.count
    random_offset = rand(count)
    #@random_equipe = Equipe.offset(random_offset).first
    @random_equipe = Equipe.limit(2).order("RANDOM()")
---
SELECT COUNT(*) FROM "equipes"
SELECT "equipes".* FROM "equipes" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 2]]

    def set_equipe
      @equipe = Equipe.find(params[:id])
---
SELECT "equipes".* FROM "equipes" WHERE "equipes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]