app/controllers/partidas_controller.rb

SELECT "partidas".* FROM "partidas"
---
  def index
    @partidas = Partida.all

INSERT INTO "partidas" ("time1_id", "time2_id", "data_partida", "vencedor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["time1_id", nil], ["time2_id", nil], ["data_partida", nil], ["vencedor_id", nil], ["created_at", "2023-01-26 19:40:59.625414"], ["updated_at", "2023-01-26 19:40:59.625414"]]
---
  def create
    @partida = Partida.new(partida_params)

    if @partida.save